#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_vpc.myvpc: Refreshing state... [id=vpc-07d4a6e67a4d5a9a7]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_vpc.myvpc must be replaced
-/+ resource "aws_vpc" "myvpc" {
      ~ arn                                  = "arn:aws:ec2:us-east-2:491580584376:vpc/vpc-07d4a6e67a4d5a9a7" -> (known after apply)
      - assign_generated_ipv6_cidr_block     = false -> null
      ~ cidr_block                           = "10.0.0.0/16" -> "10.10.0.0/16" # forces replacement
      ~ default_network_acl_id               = "acl-05e9ff72016b7e9ce" -> (known after apply)
      ~ default_route_table_id               = "rtb-02fde02ca6d4a5bd7" -> (known after apply)
      ~ default_security_group_id            = "sg-05746e444a743a344" -> (known after apply)
      ~ dhcp_options_id                      = "dopt-0e5017b3925e90b73" -> (known after apply)
      ~ enable_classiclink                   = false -> (known after apply)
      ~ enable_classiclink_dns_support       = false -> (known after apply)
      ~ enable_dns_hostnames                 = false -> (known after apply)
      ~ enable_network_address_usage_metrics = false -> (known after apply)
      ~ id                                   = "vpc-07d4a6e67a4d5a9a7" -> (known after apply)
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      - ipv6_netmask_length                  = 0 -> null
      ~ main_route_table_id                  = "rtb-02fde02ca6d4a5bd7" -> (known after apply)
      ~ owner_id                             = "491580584376" -> (known after apply)
        tags                                 = {
            "Name" = "myvpc"
        }
        # (3 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @josmbrio, Action: `pull_request`*